Repository: ATFinke-Productions/Steppy-2
Catalog: Shared/*.lproj/Localizable.strings
Languages: cy, ja

# Shared GC Error Title
source: Game Center Not Available
cy: Nid yw'r Game Center ar gael
ja: Game Center にアクセスできません

# Shared GC Error Message
source: Seems there was an error trying to sign in for Game Center. Try logging in through the Game Center app.
cy: Roedd gwall wrth geisio mewngofnodi i'r Game Center. Rhowch gynnig ar fewngofnodi trwy ap y Game Center.
ja: Game Center へのログイン中にエラーが発生したようです。Game Center アプリを通じてログインしてみてください。

# Shared GC Error Button
source: Ok, Thanks.
cy: Iawn, diolch.
ja: 分かりました。

# Shared Steps Title
source: %@ Steps
cy: %@ Cam
ja: %@ 歩

# Setup Device Title
source: Welcome to Steppy!
cy: Croeso i Steppy!
ja: Steppyへようこそ！

# Setup Device Continue Button
source: Continue
cy: Parhau
ja: 続行

# Setup GC Title
source: Enable Game Center
cy: Galluogi'r Game Center
ja: Game Centerを有効にする

# Setup GC Main Button
source: Log In
cy: Mewngofnodi
ja: ログイン

# Leaderboards Title
source: Leaderboards
cy: Byrddau Cadw Sgôr
ja: リーダーボード

# Leaderboards Today Text
source: Today
cy: Heddiw
ja: 今日

# Leaderboards Week Text
source: This Week
cy: Wythnos Hon
ja: 今週

# Leaderboards Total Text
source: Total
cy: Cyfanswm
ja: 総計

# Week Total Steps Title
source: Total Steps
cy: Cyfanswm y Camau
ja: 合計歩数

source: Loading
cy: Wrthi'n Llwytho
ja: 読み込み中

# Game Center Disclaimer
source: Sign into Game Center to share your step count and compete with others around the world
cy: Mewngofnodwch i'r Game Center i rannu nifer eich camau a chystadlu ag eraill o amgylch y byd
ja: 歩数をシェアして世界中の人たちと歩数を競うには、Game Center にサインインしてください

# Game Center Disable
source: Disable Game Center
cy: Analluogi'r Game Center
ja: Game Center を無効にする

# Game Center Logged In
source: Logged In
cy: Wedi Mewngofnodi
ja: ログインされています

# HealthKit Disclaimer
source: Steppy needs access to your step and distance data from the Health app to provide the best experience
cy: Mae Steppy angen mynediad at y data ar eich camau a phellteroedd o'r ap Iechyd i ddarparu'r profiad gorau
ja: 最高の使用体験をお届けするため、Steppy はヘルスケアアプリの歩数と歩行距離データへのアクセスを必要としています

# Grant Access Button
source: Grant Access
cy: Caniatáu Mynediad
ja: アクセスを許可

# No Health App Title
source: Data Not Available
cy: Data ddim ar gael
ja: 使用可能なデータなし

# No Health App Message
source: Health app data is required for Steppy to provide the best experience
cy: Mae angen data o'r ap Iechyd er mwyn i Steppy ddarparu'r profiad gorau
ja: Steppy が最高の使用体験をお届けできるようにするには、ヘルスケアアプリの健康データが必要です

# No Data Title
source: No Data
cy: Dim Data
ja: データなし

# No Data Message
source: Steppy needs step and distance data from the Health app to provide the best expierence. Please go to the Health app and ensure that there is data and Steppy has read access.
cy: Mae Steppy angen mynediad at y data ar eich camau a phellteroedd o'r ap Iechyd i ddarparu'r profiad gorau. Ewch i'r ap Iechyd a sicrhewch fod data ar gael a bod gan Steppy caniatâd darllen.
ja: 最高の使用体験をお届けするため、Steppy はヘルスケアアプリの歩数と歩行距離データを必要としています。ヘルスケアアプリを開いて健康データが存在し、それに Steppy がアクセスできるようにしてください。

# About Title
source: About
cy: Ynglŷn â'r Ap
ja: Steppy について

# Website Button
source: Visit Website
cy: Ymweld â'r Wefan
ja: ウェブサイトを開く

# Source Code Button
source: View Source Code
cy: Gweld y Cod Ffynhonnell
ja: ソースコードを閲覧

# Support Button
source: Email Support
cy: Cefnogaeth ar E-bost
ja: サポートにメール送信
